app/controllers/school_classes_controller.rb

  def index
    @schoolclasses = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def create
    @schoolclass = SchoolClass.new(schoolclass_params(:title, :room_number))
    @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-08-29 02:15:58.152105"], ["updated_at", "2019-08-29 02:15:58.152105"]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
	  @schoolclass.update(post_params(:title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-08-29 02:26:23.000785"], ["id", 1]]